package test;

public class Loops_and_operators {
    public static void main (String [] args ){
//dz Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно
//        for (int i = 10; i <= 20; i++){
//            System.out.println(i * i);
//        }
        // обычный цикл for
//        for(float i =  320; i >= 5; i /= 2 ){
//            System.out.println("Elemets: " + i);
//        }

        // отличается только форматом записей условиями в while указывается только условие а в for можно создать пермененую потом условие выполнения цикла и потом каким образом переменная будет изменяться

//        int i = 1;
//        while (i < 10){
//            System.out.println("Elements: "+ i);
//            i++;
//        }

        // точно тоже самое что и while кроме того что мы минимум один раз выполняет цикл а потом уже проверяем условие в while()
//        int i = 11;
//        do {
//            i++;
//            System.out.println(i);
//        }while (i < 10);



//        for (int i = 10; i < 25 ;i+=2){
//            if( i % 3 == 0 )continue;
//
//            if (i >= 17) break;
//            System.out.println("Elements: " + i);
//        }


        // continue пропускает одну иттерацию
        // break выходит из цикл
    }
}
